import { PeriodsType } from "types";

const periods: PeriodsType = [
  {
    start: "1960",
    end: "1965",
    category: "Космические открытия",
    events: [
      {
        year: "1961",
        title: "Первый человек в космосе",
        description: "Юрий Гагарин стал первым человеком, побывавшим в космосе.",
      },
      {
        year: "1962",
        title: "Первый пролёт мимо планеты",
        description: "Аппарат Маринер-2 впервые пролетел мимо Венеры.",
      },
      {
        year: "1963",
        title: "Первая женщина в космосе",
        description: "Валентина Терешкова стала первой женщиной-космонавтом.",
      },
      {
        year: "1964",
        title: "Первый запуск многоместного корабля",
        description: "Космический корабль «Восход» впервые совершил полет с экипажем из трех человек.",
      },
      {
        year: "1965",
        title: "Первый выход в открытый космос",
        description: "Алексей Леонов впервые в истории вышел в открытый космос.",
      },
    ],
  },
  {
    start: "1970",
    end: "1975",
    category: "Технологические достижения",
    events: [
      {
        year: "1970",
        title: "Первый луноход",
        description: "Советский «Луноход-1» стал первым управляемым аппаратом на Луне.",
      },
      {
        year: "1971",
        title: "Создание микропроцессоров",
        description: "Intel выпустила первый в мире микропроцессор 4004.",
      },
      {
        year: "1972",
        title: "Видеоигра Pong",
        description: "Компания Atari выпустила первую популярную видеоигру Pong.",
      },
      {
        year: "1973",
        title: "Первый звонок с мобильного телефона",
        description: "Мартин Купер совершил первый звонок с мобильного телефона.",
      },
      {
        year: "1975",
        title: "Основание компании Microsoft",
        description: "Билл Гейтс и Пол Аллен основали Microsoft.",
      },
    ],
  },
  {
    start: "1980",
    end: "1985",
    category: "Инновации",
    events: [
      {
        year: "1981",
        title: "Первый IBM PC",
        description: "IBM выпустила первый персональный компьютер.",
      },
      {
        year: "1982",
        title: "Появление компакт-дисков",
        description: "Sony и Philips представили первый коммерческий компакт-диск.",
      },
      {
        year: "1983",
        title: "Создание интернета",
        description: "Переход сети ARPANET на протокол TCP/IP положил начало интернету.",
      },
      {
        year: "1984",
        title: "Презентация Macintosh",
        description: "Apple представила Macintosh с графическим интерфейсом.",
      },
      {
        year: "1985",
        title: "Выпуск Windows 1.0",
        description: "Microsoft выпустила первую версию операционной системы Windows.",
      },
    ],
  },
  {
    start: "1990",
    end: "1995",
    category: "Эра интернета",
    events: [
      {
        year: "1990",
        title: "Запуск телескопа Хаббл",
        description: "Космический телескоп «Хаббл» был выведен на орбиту.",
      },
      {
        year: "1991",
        title: "Появление Всемирной паутины",
        description: "Тим Бернерс-Ли представил Всемирную паутину.",
      },
      {
        year: "1993",
        title: "Первые графические браузеры",
        description: "Браузер Mosaic стал первым широко используемым графическим веб-браузером.",
      },
      {
        year: "1994",
        title: "Запуск PlayStation",
        description: "Компания Sony выпустила первую консоль PlayStation.",
      },
      {
        year: "1995",
        title: "Запуск языка Java",
        description: "Компания Sun Microsystems представила язык программирования Java.",
      },
    ],
  },
  {
    start: "2000",
    end: "2005",
    category: "Цифровая эпоха",
    events: [
      {
        year: "2000",
        title: "Запуск Google AdWords",
        description: "Google представила сервис контекстной рекламы AdWords.",
      },
      {
        year: "2001",
        title: "Запуск Википедии",
        description: "Была запущена онлайн-энциклопедия Wikipedia.",
      },
      {
        year: "2003",
        title: "Открытие социальной сети LinkedIn",
        description: "LinkedIn начала свою деятельность как сеть для профессионалов.",
      },
      {
        year: "2004",
        title: "Запуск Facebook",
        description: "Марк Цукерберг запустил социальную сеть Facebook.",
      },
      {
        year: "2005",
        title: "Запуск YouTube",
        description: "Видеоплатформа YouTube была запущена в феврале 2005 года.",
      },
    ],
  },
];

export default periods;
